Output result:

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.example.azurecaf_name.public_ip_addresses["lb_pip1"] will be created
  + resource "azurecaf_name" "public_ip_addresses" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "lb_pip1"
      + passthrough   = false
      + prefixes      = (known after apply)
      + random_length = 0
      + resource_type = "azurerm_public_ip"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = true
    }

  # module.example.azurecaf_name.public_ip_addresses["lb_pip2"] will be created
  + resource "azurecaf_name" "public_ip_addresses" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "lb_pip12"
      + passthrough   = false
      + prefixes      = (known after apply)
      + random_length = 0
      + resource_type = "azurerm_public_ip"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = true
    }

  # module.example.random_string.prefix[0] will be created
  + resource "random_string" "prefix" {
      + id          = (known after apply)
      + length      = 4
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = false
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.example.module.application_security_groups["app_sg1"].azurecaf_name.asg will be created
  + resource "azurecaf_name" "asg" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "app_sg1"
      + passthrough   = false
      + prefixes      = (known after apply)
      + random_length = 0
      + resource_type = "azurerm_application_security_group"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = true
    }

  # module.example.module.application_security_groups["app_sg1"].azurerm_application_security_group.asg will be created
  + resource "azurerm_application_security_group" "asg" {
      + id                  = (known after apply)
      + location            = "southeastasia"
      + name                = (known after apply)
      + resource_group_name = (known after apply)
      + tags                = {
          + "module" = "application_security_group"
        }
    }

  # module.example.module.diagnostic_storage_accounts["bootdiag1"].azurecaf_name.stg will be created
  + resource "azurecaf_name" "stg" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "lebootdiag1"
      + passthrough   = false
      + prefixes      = (known after apply)
      + random_length = 0
      + resource_type = "azurerm_storage_account"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = true
    }

  # module.example.module.diagnostic_storage_accounts["bootdiag1"].azurerm_storage_account.stg will be created
  + resource "azurerm_storage_account" "stg" {
      + access_tier                      = "Cool"
      + account_kind                     = "StorageV2"
      + account_replication_type         = "LRS"
      + account_tier                     = "Standard"
      + allow_blob_public_access         = false
      + enable_https_traffic_only        = true
      + id                               = (known after apply)
      + is_hns_enabled                   = false
      + large_file_share_enabled         = (known after apply)
      + location                         = "southeastasia"
      + min_tls_version                  = "TLS1_2"
      + name                             = (known after apply)
      + nfsv3_enabled                    = false
      + primary_access_key               = (sensitive value)
      + primary_blob_connection_string   = (sensitive value)
      + primary_blob_endpoint            = (known after apply)
      + primary_blob_host                = (known after apply)
      + primary_connection_string        = (sensitive value)
      + primary_dfs_endpoint             = (known after apply)
      + primary_dfs_host                 = (known after apply)
      + primary_file_endpoint            = (known after apply)
      + primary_file_host                = (known after apply)
      + primary_location                 = (known after apply)
      + primary_queue_endpoint           = (known after apply)
      + primary_queue_host               = (known after apply)
      + primary_table_endpoint           = (known after apply)
      + primary_table_host               = (known after apply)
      + primary_web_endpoint             = (known after apply)
      + primary_web_host                 = (known after apply)
      + resource_group_name              = (known after apply)
      + secondary_access_key             = (sensitive value)
      + secondary_blob_connection_string = (sensitive value)
      + secondary_blob_endpoint          = (known after apply)
      + secondary_blob_host              = (known after apply)
      + secondary_connection_string      = (sensitive value)
      + secondary_dfs_endpoint           = (known after apply)
      + secondary_dfs_host               = (known after apply)
      + secondary_file_endpoint          = (known after apply)
      + secondary_file_host              = (known after apply)
      + secondary_location               = (known after apply)
      + secondary_queue_endpoint         = (known after apply)
      + secondary_queue_host             = (known after apply)
      + secondary_table_endpoint         = (known after apply)
      + secondary_table_host             = (known after apply)
      + secondary_web_endpoint           = (known after apply)
      + secondary_web_host               = (known after apply)
      + shared_access_key_enabled        = true

      + blob_properties {
          + change_feed_enabled      = (known after apply)
          + default_service_version  = (known after apply)
          + last_access_time_enabled = (known after apply)
          + versioning_enabled       = (known after apply)

          + container_delete_retention_policy {
              + days = (known after apply)
            }

          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + delete_retention_policy {
              + days = (known after apply)
            }
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = (known after apply)
        }

      + network_rules {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)

          + private_link_access {
              + endpoint_resource_id = (known after apply)
              + endpoint_tenant_id   = (known after apply)
            }
        }

      + queue_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + hour_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }

          + logging {
              + delete                = (known after apply)
              + read                  = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
              + write                 = (known after apply)
            }

          + minute_metrics {
              + enabled               = (known after apply)
              + include_apis          = (known after apply)
              + retention_policy_days = (known after apply)
              + version               = (known after apply)
            }
        }

      + routing {
          + choice                      = (known after apply)
          + publish_internet_endpoints  = (known after apply)
          + publish_microsoft_endpoints = (known after apply)
        }

      + share_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + retention_policy {
              + days = (known after apply)
            }

          + smb {
              + authentication_types            = (known after apply)
              + channel_encryption_type         = (known after apply)
              + kerberos_ticket_encryption_type = (known after apply)
              + versions                        = (known after apply)
            }
        }
    }

  # module.example.module.keyvaults["kv1"].azurecaf_name.keyvault will be created
  + resource "azurecaf_name" "keyvault" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "vmsslbexmpkv1"
      + passthrough   = false
      + prefixes      = (known after apply)
      + random_length = 0
      + resource_type = "azurerm_key_vault"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = true
    }

  # module.example.module.keyvaults["kv1"].azurerm_key_vault.keyvault will be created
  + resource "azurerm_key_vault" "keyvault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = false
      + enabled_for_deployment          = false
      + enabled_for_disk_encryption     = false
      + enabled_for_template_deployment = false
      + id                              = (known after apply)
      + location                        = "southeastasia"
      + name                            = (known after apply)
      + purge_protection_enabled        = false
      + resource_group_name             = (known after apply)
      + sku_name                        = "standard"
      + soft_delete_enabled             = (known after apply)
      + soft_delete_retention_days      = 7
      + tenant_id                       = "28cd23f5-9d83-4d2c-820e-9dd501857e1d"
      + vault_uri                       = (known after apply)

      + network_acls {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }

      + timeouts {
          + delete = "60m"
        }
    }

  # module.example.module.load_balancers["lb1"].azurecaf_name.lb_name will be created
  + resource "azurecaf_name" "lb_name" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "lb-vmss"
      + passthrough   = false
      + prefixes      = (known after apply)
      + random_length = 0
      + resource_type = "azurerm_lb"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = true
    }

  # module.example.module.load_balancers["lb1"].azurerm_lb.lb will be created
  + resource "azurerm_lb" "lb" {
      + id                   = (known after apply)
      + location             = "southeastasia"
      + name                 = (known after apply)
      + private_ip_address   = (known after apply)
      + private_ip_addresses = (known after apply)
      + resource_group_name  = (known after apply)
      + sku                  = "basic"
      + sku_tier             = "Regional"
      + tags                 = {
          + "module" = "load_balancers"
        }

      + frontend_ip_configuration {
          + availability_zone             = (known after apply)
          + id                            = (known after apply)
          + inbound_nat_rules             = (known after apply)
          + load_balancer_rules           = (known after apply)
          + name                          = "config1"
          + outbound_rules                = (known after apply)
          + private_ip_address            = (known after apply)
          + private_ip_address_allocation = (known after apply)
          + private_ip_address_version    = (known after apply)
          + public_ip_address_id          = (known after apply)
          + public_ip_prefix_id           = (known after apply)
          + subnet_id                     = (known after apply)
          + zones                         = (known after apply)
        }
    }

  # module.example.module.load_balancers["lb1"].azurerm_lb_backend_address_pool.backend_address_pool[0] will be created
  + resource "azurerm_lb_backend_address_pool" "backend_address_pool" {
      + backend_ip_configurations = (known after apply)
      + id                        = (known after apply)
      + load_balancing_rules      = (known after apply)
      + loadbalancer_id           = (known after apply)
      + name                      = "vmss1"
      + outbound_rules            = (known after apply)
      + resource_group_name       = (known after apply)
    }

  # module.example.module.load_balancers["lb2"].azurecaf_name.lb_name will be created
  + resource "azurecaf_name" "lb_name" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "lb-vmss2"
      + passthrough   = false
      + prefixes      = (known after apply)
      + random_length = 0
      + resource_type = "azurerm_lb"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = true
    }

  # module.example.module.load_balancers["lb2"].azurerm_lb.lb will be created
  + resource "azurerm_lb" "lb" {
      + id                   = (known after apply)
      + location             = "southeastasia"
      + name                 = (known after apply)
      + private_ip_address   = (known after apply)
      + private_ip_addresses = (known after apply)
      + resource_group_name  = (known after apply)
      + sku                  = "basic"
      + sku_tier             = "Regional"
      + tags                 = {
          + "module" = "load_balancers"
        }

      + frontend_ip_configuration {
          + availability_zone             = (known after apply)
          + id                            = (known after apply)
          + inbound_nat_rules             = (known after apply)
          + load_balancer_rules           = (known after apply)
          + name                          = "config1"
          + outbound_rules                = (known after apply)
          + private_ip_address            = (known after apply)
          + private_ip_address_allocation = (known after apply)
          + private_ip_address_version    = (known after apply)
          + public_ip_address_id          = (known after apply)
          + public_ip_prefix_id           = (known after apply)
          + subnet_id                     = (known after apply)
          + zones                         = (known after apply)
        }
    }

  # module.example.module.load_balancers["lb2"].azurerm_lb_backend_address_pool.backend_address_pool[0] will be created
  + resource "azurerm_lb_backend_address_pool" "backend_address_pool" {
      + backend_ip_configurations = (known after apply)
      + id                        = (known after apply)
      + load_balancing_rules      = (known after apply)
      + loadbalancer_id           = (known after apply)
      + name                      = "vmss1"
      + outbound_rules            = (known after apply)
      + resource_group_name       = (known after apply)
    }

  # module.example.module.managed_identities["example_mi"].azurecaf_name.msi will be created
  + resource "azurecaf_name" "msi" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "example_mi"
      + passthrough   = false
      + prefixes      = (known after apply)
      + random_length = 0
      + resource_type = "azurerm_user_assigned_identity"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = true
    }

  # module.example.module.managed_identities["example_mi"].azurerm_user_assigned_identity.msi will be created
  + resource "azurerm_user_assigned_identity" "msi" {
      + client_id           = (known after apply)
      + id                  = (known after apply)
      + location            = (known after apply)
      + name                = (known after apply)
      + principal_id        = (known after apply)
      + resource_group_name = (known after apply)
      + tags                = (known after apply)
      + tenant_id           = (known after apply)
    }

  # module.example.module.managed_identities["example_mi"].time_sleep.propagate_to_azuread will be created
  + resource "time_sleep" "propagate_to_azuread" {
      + create_duration = "30s"
      + id              = (known after apply)
    }

  # module.example.module.monitor_autoscale_settings["mas1"].azurerm_monitor_autoscale_setting.this will be created
  + resource "azurerm_monitor_autoscale_setting" "this" {
      + enabled             = true
      + id                  = (known after apply)
      + location            = "southeastasia"
      + name                = "mas1"
      + resource_group_name = (known after apply)
      + target_resource_id  = (known after apply)

      + profile {
          + name = "profile1"

          + capacity {
              + default = 1
              + maximum = 3
              + minimum = 1
            }

          + rule {
              + metric_trigger {
                  + metric_name        = "Percentage CPU"
                  + metric_resource_id = (known after apply)
                  + operator           = "GreaterThan"
                  + statistic          = "Average"
                  + threshold          = 90
                  + time_aggregation   = "Average"
                  + time_grain         = "PT1M"
                  + time_window        = "PT5M"
                }

              + scale_action {
                  + cooldown  = "PT1M"
                  + direction = "Increase"
                  + type      = "ChangeCount"
                  + value     = 2
                }
            }
        }
    }

  # module.example.module.networking["vnet1"].azurecaf_name.caf_name_vnet will be created
  + resource "azurecaf_name" "caf_name_vnet" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "vmss"
      + passthrough   = false
      + prefixes      = (known after apply)
      + random_length = 0
      + resource_type = "azurerm_virtual_network"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = true
    }

  # module.example.module.networking["vnet1"].azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space         = [
          + "10.100.0.0/16",
        ]
      + dns_servers           = []
      + guid                  = (known after apply)
      + id                    = (known after apply)
      + location              = "southeastasia"
      + name                  = (known after apply)
      + resource_group_name   = (known after apply)
      + subnet                = (known after apply)
      + tags                  = {
          + "module" = "virtual_network"
        }
      + vm_protection_enabled = false
    }

  # module.example.module.public_ip_addresses["lb_pip1"].azurerm_public_ip.pip will be created
  + resource "azurerm_public_ip" "pip" {
      + allocation_method       = "Dynamic"
      + availability_zone       = "No-Zone"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "southeastasia"
      + name                    = (known after apply)
      + resource_group_name     = (known after apply)
      + sku                     = "Basic"
      + sku_tier                = "Regional"
      + tags                    = {
          + "module" = "public_ip_addresses"
        }
      + zones                   = (known after apply)
    }

  # module.example.module.public_ip_addresses["lb_pip2"].azurerm_public_ip.pip will be created
  + resource "azurerm_public_ip" "pip" {
      + allocation_method       = "Dynamic"
      + availability_zone       = "No-Zone"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "southeastasia"
      + name                    = (known after apply)
      + resource_group_name     = (known after apply)
      + sku                     = "Basic"
      + sku_tier                = "Regional"
      + tags                    = {
          + "module" = "public_ip_addresses"
        }
      + zones                   = (known after apply)
    }

  # module.example.module.resource_groups["rg1"].azurecaf_name.rg will be created
  + resource "azurecaf_name" "rg" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "vmss-autoscale-lb-rg"
      + passthrough   = false
      + prefixes      = (known after apply)
      + random_length = 0
      + resource_type = "azurerm_resource_group"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = true
    }

  # module.example.module.resource_groups["rg1"].azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "southeastasia"
      + name     = (known after apply)
      + tags     = {
          + "landingzone" = "examples"
        }
    }

  # module.example.module.virtual_machine_scale_sets["vmss1"].azurecaf_name.linux["linux"] will be created
  + resource "azurecaf_name" "linux" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "linux_vmss1"
      + passthrough   = false
      + prefixes      = (known after apply)
      + random_length = 0
      + resource_type = "azurerm_virtual_machine_scale_set"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = true
    }

  # module.example.module.virtual_machine_scale_sets["vmss1"].azurecaf_name.linux_computer_name_prefix["linux"] will be created
  + resource "azurecaf_name" "linux_computer_name_prefix" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "lnx"
      + passthrough   = false
      + prefixes      = (known after apply)
      + random_length = 0
      + resource_type = "azurerm_virtual_machine_scale_set"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = true
    }

  # module.example.module.virtual_machine_scale_sets["vmss1"].azurecaf_name.linux_nic["nic0"] will be created
  + resource "azurecaf_name" "linux_nic" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "0"
      + passthrough   = false
      + prefixes      = (known after apply)
      + random_length = 0
      + resource_type = "azurerm_network_interface"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = true
    }

  # module.example.module.virtual_machine_scale_sets["vmss1"].azurecaf_name.os_disk_linux["linux"] will be created
  + resource "azurecaf_name" "os_disk_linux" {
      + clean_input   = true
      + id            = (known after apply)
      + passthrough   = false
      + prefixes      = (known after apply)
      + random_length = 0
      + resource_type = "azurerm_managed_disk"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = true
    }

  # module.example.module.virtual_machine_scale_sets["vmss1"].azurerm_key_vault_secret.ssh_private_key["linux"] will be created
  + resource "azurerm_key_vault_secret" "ssh_private_key" {
      + id             = (known after apply)
      + key_vault_id   = (known after apply)
      + name           = (known after apply)
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # module.example.module.virtual_machine_scale_sets["vmss1"].azurerm_key_vault_secret.ssh_public_key_openssh["linux"] will be created
  + resource "azurerm_key_vault_secret" "ssh_public_key_openssh" {
      + id             = (known after apply)
      + key_vault_id   = (known after apply)
      + name           = (known after apply)
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # module.example.module.virtual_machine_scale_sets["vmss1"].azurerm_linux_virtual_machine_scale_set.vmss["linux"] will be created
  + resource "azurerm_linux_virtual_machine_scale_set" "vmss" {
      + admin_username                                    = "adminuser"
      + computer_name_prefix                              = (known after apply)
      + disable_password_authentication                   = true
      + do_not_run_extensions_on_overprovisioned_machines = false
      + eviction_policy                                   = "Deallocate"
      + extensions_time_budget                            = "PT1H30M"
      + id                                                = (known after apply)
      + instances                                         = 1
      + location                                          = (known after apply)
      + max_bid_price                                     = -1
      + name                                              = (known after apply)
      + overprovision                                     = true
      + platform_fault_domain_count                       = (known after apply)
      + priority                                          = "Spot"
      + provision_vm_agent                                = true
      + resource_group_name                               = (known after apply)
      + scale_in_policy                                   = "Default"
      + single_placement_group                            = true
      + sku                                               = "Standard_F2"
      + tags                                              = {
          + "module" = "virtual_machine_scale_set"
        }
      + unique_id                                         = (known after apply)
      + upgrade_mode                                      = "Manual"
      + zone_balance                                      = false

      + admin_ssh_key {
          + public_key = (known after apply)
          + username   = "adminuser"
        }

      + automatic_instance_repair {
          + enabled      = (known after apply)
          + grace_period = (known after apply)
        }

      + boot_diagnostics {
          + storage_account_uri = (known after apply)
        }

      + data_disk {
          + caching                   = "None"
          + create_option             = "Empty"
          + disk_iops_read_write      = (known after apply)
          + disk_mbps_read_write      = (known after apply)
          + disk_size_gb              = 10
          + lun                       = 1
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + extension {
          + auto_upgrade_minor_version = (known after apply)
          + force_update_tag           = (known after apply)
          + name                       = (known after apply)
          + protected_settings         = (sensitive value)
          + provision_after_extensions = (known after apply)
          + publisher                  = (known after apply)
          + settings                   = (known after apply)
          + type                       = (known after apply)
          + type_handler_version       = (known after apply)
        }

      + identity {
          + identity_ids = (known after apply)
          + principal_id = (known after apply)
          + type         = "UserAssigned"
        }

      + network_interface {
          + enable_accelerated_networking = false
          + enable_ip_forwarding          = false
          + name                          = (known after apply)
          + primary                       = true

          + ip_configuration {
              + application_security_group_ids         = (known after apply)
              + load_balancer_backend_address_pool_ids = (known after apply)
              + name                                   = (known after apply)
              + primary                                = true
              + subnet_id                              = (known after apply)
              + version                                = "IPv4"
            }
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = 128
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "UbuntuServer"
          + publisher = "Canonical"
          + sku       = "18.04-LTS"
          + version   = "latest"
        }

      + terminate_notification {
          + enabled = (known after apply)
          + timeout = (known after apply)
        }
    }

  # module.example.module.virtual_machine_scale_sets["vmss1"].tls_private_key.ssh["linux"] will be created
  + resource "tls_private_key" "ssh" {
      + algorithm                  = "RSA"
      + ecdsa_curve                = "P224"
      + id                         = (known after apply)
      + private_key_pem            = (sensitive value)
      + public_key_fingerprint_md5 = (known after apply)
      + public_key_openssh         = (known after apply)
      + public_key_pem             = (known after apply)
      + rsa_bits                   = 4096
    }

  # module.example.module.virtual_machine_scale_sets["vmss2"].azurecaf_name.os_disk_windows["windows"] will be created
  + resource "azurecaf_name" "os_disk_windows" {
      + clean_input   = true
      + id            = (known after apply)
      + passthrough   = false
      + prefixes      = (known after apply)
      + random_length = 0
      + resource_type = "azurerm_managed_disk"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = true
    }

  # module.example.module.virtual_machine_scale_sets["vmss2"].azurecaf_name.windows["windows"] will be created
  + resource "azurecaf_name" "windows" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "win"
      + passthrough   = false
      + prefixes      = (known after apply)
      + random_length = 0
      + resource_type = "azurerm_virtual_machine_scale_set"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = true
    }

  # module.example.module.virtual_machine_scale_sets["vmss2"].azurecaf_name.windows_computer_name_prefix["windows"] will be created
  + resource "azurecaf_name" "windows_computer_name_prefix" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "win"
      + passthrough   = false
      + prefixes      = (known after apply)
      + random_length = 0
      + resource_type = "azurerm_vm_windows_computer_name_prefix"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = true
    }

  # module.example.module.virtual_machine_scale_sets["vmss2"].azurecaf_name.windows_nic["nic0"] will be created
  + resource "azurecaf_name" "windows_nic" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "0"
      + passthrough   = false
      + prefixes      = (known after apply)
      + random_length = 0
      + resource_type = "azurerm_network_interface"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = true
    }

  # module.example.module.virtual_machine_scale_sets["vmss2"].azurerm_key_vault_secret.admin_password["windows"] will be created
  + resource "azurerm_key_vault_secret" "admin_password" {
      + id             = (known after apply)
      + key_vault_id   = (known after apply)
      + name           = (known after apply)
      + value          = (sensitive value)
      + version        = (known after apply)
      + versionless_id = (known after apply)
    }

  # module.example.module.virtual_machine_scale_sets["vmss2"].azurerm_windows_virtual_machine_scale_set.vmss["windows"] will be created
  + resource "azurerm_windows_virtual_machine_scale_set" "vmss" {
      + admin_password                                    = (sensitive value)
      + admin_username                                    = "adminuser"
      + computer_name_prefix                              = (known after apply)
      + do_not_run_extensions_on_overprovisioned_machines = false
      + enable_automatic_updates                          = true
      + eviction_policy                                   = "Deallocate"
      + extensions_time_budget                            = "PT1H30M"
      + id                                                = (known after apply)
      + instances                                         = 1
      + location                                          = (known after apply)
      + max_bid_price                                     = -1
      + name                                              = (known after apply)
      + overprovision                                     = true
      + platform_fault_domain_count                       = (known after apply)
      + priority                                          = "Spot"
      + provision_vm_agent                                = true
      + resource_group_name                               = (known after apply)
      + scale_in_policy                                   = "Default"
      + single_placement_group                            = true
      + sku                                               = "Standard_F2"
      + tags                                              = {
          + "module" = "virtual_machine_scale_set"
        }
      + unique_id                                         = (known after apply)
      + upgrade_mode                                      = "Manual"
      + zone_balance                                      = false

      + automatic_instance_repair {
          + enabled      = (known after apply)
          + grace_period = (known after apply)
        }

      + boot_diagnostics {
          + storage_account_uri = (known after apply)
        }

      + data_disk {
          + caching                   = "None"
          + create_option             = "Empty"
          + disk_iops_read_write      = (known after apply)
          + disk_mbps_read_write      = (known after apply)
          + disk_size_gb              = 10
          + lun                       = 1
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + extension {
          + auto_upgrade_minor_version = (known after apply)
          + force_update_tag           = (known after apply)
          + name                       = (known after apply)
          + protected_settings         = (sensitive value)
          + provision_after_extensions = (known after apply)
          + publisher                  = (known after apply)
          + settings                   = (known after apply)
          + type                       = (known after apply)
          + type_handler_version       = (known after apply)
        }

      + identity {
          + principal_id = (known after apply)
          + type         = "SystemAssigned"
        }

      + network_interface {
          + enable_accelerated_networking = false
          + enable_ip_forwarding          = false
          + name                          = (known after apply)
          + primary                       = true

          + ip_configuration {
              + application_security_group_ids         = (known after apply)
              + load_balancer_backend_address_pool_ids = (known after apply)
              + name                                   = (known after apply)
              + primary                                = true
              + subnet_id                              = (known after apply)
              + version                                = "IPv4"
            }
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = 128
          + storage_account_type      = "Standard_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "WindowsServer"
          + publisher = "MicrosoftWindowsServer"
          + sku       = "2016-Datacenter"
          + version   = "latest"
        }

      + terminate_notification {
          + enabled = (known after apply)
          + timeout = (known after apply)
        }
    }

  # module.example.module.virtual_machine_scale_sets["vmss2"].random_password.admin["windows"] will be created
  + resource "random_password" "admin" {
      + id               = (known after apply)
      + length           = 123
      + lower            = true
      + min_lower        = 2
      + min_numeric      = 0
      + min_special      = 2
      + min_upper        = 2
      + number           = true
      + override_special = "!@#$%&"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

  # module.example.module.networking["vnet1"].module.subnets["subnet1"].azurecaf_name.subnet will be created
  + resource "azurecaf_name" "subnet" {
      + clean_input   = true
      + id            = (known after apply)
      + name          = "compute"
      + passthrough   = false
      + prefixes      = (known after apply)
      + random_length = 0
      + resource_type = "azurerm_subnet"
      + result        = (known after apply)
      + results       = (known after apply)
      + separator     = "-"
      + use_slug      = true
    }

  # module.example.module.networking["vnet1"].module.subnets["subnet1"].azurerm_subnet.subnet will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefix                                 = (known after apply)
      + address_prefixes                               = [
          + "10.100.1.0/24",
        ]
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + name                                           = (known after apply)
      + resource_group_name                            = (known after apply)
      + service_endpoints                              = []
      + virtual_network_name                           = (known after apply)
    }

  # module.example.module.keyvaults["kv1"].module.initial_policy[0].module.logged_in_user["logged_in_user"].azurerm_key_vault_access_policy.policy will be created
  + resource "azurerm_key_vault_access_policy" "policy" {
      + id                 = (known after apply)
      + key_vault_id       = (known after apply)
      + object_id          = "c65c38ac-be23-4321-aa58-721fc0dfba42"
      + secret_permissions = [
          + "Set",
          + "Get",
          + "List",
          + "Delete",
          + "Purge",
          + "Recover",
        ]
      + tenant_id          = "28cd23f5-9d83-4d2c-820e-9dd501857e1d"

      + timeouts {
          + delete = "60m"
        }
    }

Plan: 43 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + objects = (sensitive value)

───────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```